## Context
You work in the data analysis team of a very important company. On Monday, the company shares some good news with you: you just got hired by a major retail company! So, let's get prepared for a huge amount of work!

Then you get to work with your team and define the following tasks to perform:   
1. You need to start your analysis using data from the past.  
2. You need to define a process that takes your daily data as an input and integrates it.  

You are in charge of the second part, so you are provided with a sample file that you will have to read daily. To complete you task, you need the following aggregates:
* One aggregate per store that adds up the rest of the values.
* One aggregate per item that adds up the rest of the values.

You can import the `raw_sales` table from the database `retail_sales` fon of Ironhack's databases. 

## Your task
Therefore, your process will consist of the following steps:
1. Read the sample file that a daily process will save in your folder. 
2. Clean up the data.
3. Create the aggregates.
4. Write three tables in your local database: 
    - A table for the cleaned data.
    - A table for the aggregate per store.
    - A table for the aggregate per item.

## Instructions
* Clean the data and create the aggregates as you consider.
* Create the tables in your local database.
* Populate them with your process.

In [13]:
import numpy as np
import pandas as pd

In [14]:
data = pd.read_csv('../Datasets_as_CSV/retail_sales-raw_sales.csv', sep=";",index_col = 'date',parse_dates=True)
data

            shop_id  item_id  item_price  item_cnt_day
date
2015-01-04       29     1469      1199.0           1.0
2015-01-04       28    21364       479.0           1.0
2015-01-04       28    21365       999.0           2.0
2015-01-04       28    22104       249.0           2.0
2015-01-04       28    22091       179.0           1.0
...             ...      ...         ...           ...
2015-01-04       15     4240      1299.0           1.0
2015-01-04       14    21922        99.0           1.0
2015-01-04       15     1969      3999.0           1.0
2015-01-04       14    22091       179.0           1.0
2015-01-04       15     1007      1199.0           1.0

[4545 rows x 4 columns]

In [15]:
type(data.index)

pandas.core.indexes.datetimes.DatetimeIndex

In [16]:
data.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 4545 entries, 2015-01-04 to 2015-01-04
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   shop_id       4545 non-null   int64
 1   item_id       4545 non-null   int64
 2   item_price    4545 non-null   float64
 3   item_cnt_day  4545 non-null   float64
dtypes: float64(2), int64(2)
memory usage: 177.5 KB

In [17]:
data.describe()

           shop_id       item_id    item_price  item_cnt_day
count  4545.000000   4545.000000   4545.000000   4545.000000
mean     34.021122  11140.459406   1031.686121      1.103630
std      16.565517   6558.649572   2073.919990      0.536967
min       2.000000     30.000000      3.000000     -1.000000
25%      22.000000   4977.000000    249.000000      1.000000
50%      31.000000  11247.000000    479.000000      1.000000
75%      50.000000  16671.000000   1192.000000      1.000000
max      59.000000  22162.000000  27990.000000     10.000000

In [18]:
df = data.copy()

In [19]:
df['total_amount'] = df['item_price']*df['item_cnt_day']
df

            shop_id  item_id  item_price  item_cnt_day  total_amount
date
2015-01-04       29     1469      1199.0           1.0        1199.0
2015-01-04       28    21364       479.0           1.0         479.0
2015-01-04       28    21365       999.0           2.0        1998.0
2015-01-04       28    22104       249.0           2.0         498.0
2015-01-04       28    22091       179.0           1.0         179.0
...             ...      ...         ...           ...           ...
2015-01-04       15     4240      1299.0           1.0        1299.0
2015-01-04       14    21922        99.0           1.0          99.0
2015-01-04       15     1969      3999.0           1.0        3999.0
2015-01-04       14    22091       179.0           1.0         179.0
2015-01-04       15     1007      1199.0           1.0        1199.0

[4545 rows x 5 columns]

In [40]:
item = pd.DataFrame(df.groupby(['item_id','item_price'])[['item_cnt_day','total_amount']].sum())
item

                    item_cnt_day  total_amount
item_id item_price
30      169.0                3.0         507.0
31      363.0                3.0        1089.0
32      149.0                3.0         447.0
42      299.0                3.0         897.0
59      249.0                3.0         747.0
...                          ...           ...
22091   179.0                6.0        1074.0
22092   179.0                3.0         537.0
22104   249.0                6.0        1494.0
22140   217.5                3.0         652.5
22162   399.0               18.0        7182.0

[1027 rows x 2 columns]

In [29]:
pd.DataFrame(df.groupby(['shop_id','item_id','item_cnt_day'])['total_amount'].sum())

                              total_amount
shop_id item_id item_cnt_day
2       1970    1.0               26997.00
        1971    1.0               13497.00
        2871    1.0                2997.00
        2881    1.0                2997.00
        3028    1.0                7797.00
...                                    ...
59      20608   1.0                5997.00
        20949   2.0                  30.00
        21362   1.0                3297.00
        21364   1.0                1437.00
        21761   1.0                2316.09

[1515 rows x 1 columns]

In [31]:
pd.DataFrame(df.groupby(['shop_id'])['total_amount'].sum())

         total_amount
shop_id
2            103746.0
3             67443.0
4             29361.0
5             33138.0
6            138678.0
7             52371.0
10            22716.0
12           295173.0
14            57450.0
15           125139.0
16           121923.0
18            35787.0
19            51420.0
21           228999.0
22           150717.0
24            56955.0
25           288432.0
26           120462.0
27           172959.0
28           202512.0
29            85737.0
31           304692.0
34            12117.0
35            65769.0
37           220500.0
38            73482.0
39            34686.0
41            36840.0
42           330111.0
44           137445.0
45            82350.0
46            93903.0
47            80142.0
48            32745.0
49            35784.0
50           142053.0
51            10665.0
52            63531.0
53            50505.0
54           125343.0
55           170847.6
56            54906.0
57           226269.0
58           142863.0
59           113109.0